; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=63, out_folder=htg/blocksworld/training, instance_id=43, seed=2067, goal_proportion=0.1

(define (problem blocksworld-43)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 - object)
 (:init 
    (arm-empty)
    (clear b51)
    (on b51 b20)
    (on b20 b17)
    (on-table b17)
    (clear b4)
    (on-table b4)
    (clear b5)
    (on b5 b47)
    (on-table b47)
    (clear b63)
    (on b63 b58)
    (on-table b58)
    (clear b25)
    (on b25 b54)
    (on b54 b61)
    (on b61 b27)
    (on b27 b26)
    (on b26 b21)
    (on-table b21)
    (clear b56)
    (on-table b56)
    (clear b52)
    (on b52 b41)
    (on b41 b32)
    (on b32 b19)
    (on b19 b28)
    (on-table b28)
    (clear b24)
    (on-table b24)
    (clear b60)
    (on b60 b15)
    (on-table b15)
    (clear b40)
    (on b40 b45)
    (on b45 b14)
    (on b14 b9)
    (on b9 b10)
    (on b10 b18)
    (on b18 b46)
    (on-table b46)
    (clear b62)
    (on-table b62)
    (clear b7)
    (on b7 b2)
    (on b2 b50)
    (on b50 b59)
    (on b59 b22)
    (on b22 b29)
    (on b29 b53)
    (on-table b53)
    (clear b39)
    (on b39 b1)
    (on b1 b43)
    (on b43 b23)
    (on b23 b49)
    (on b49 b42)
    (on b42 b12)
    (on b12 b57)
    (on-table b57)
    (clear b48)
    (on b48 b37)
    (on b37 b8)
    (on b8 b55)
    (on b55 b44)
    (on b44 b11)
    (on b11 b30)
    (on b30 b34)
    (on b34 b16)
    (on b16 b35)
    (on b35 b31)
    (on-table b31)
    (clear b36)
    (on b36 b3)
    (on-table b3)
    (clear b38)
    (on b38 b13)
    (on b13 b33)
    (on-table b33)
    (clear b6)
    (on-table b6))
 (:goal  (and 
    (clear b3)
    (on-table b3)
    (clear b2)
    (on b2 b6)
    (on b6 b1)
    (on-table b1)
    (clear b5)
    (on b5 b4)
    (on-table b4))))

; plan
1. (unstack b7 b2)
   deleted: (on b7 b2) (clear b7) (arm-empty)
   added: (holding b7) (clear b2)
   goals met: 4 of 9
2. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 4 of 9
3. (unstack b36 b3)
   deleted: (on b36 b3) (clear b36) (arm-empty)
   added: (holding b36) (clear b3)
   goals met: 5 of 9
4. (putdown b36)
   deleted: (holding b36)
   added: (clear b36) (arm-empty) (on-table b36)
   goals met: 5 of 9
5. (unstack b2 b50)
   deleted: (on b2 b50) (clear b2) (arm-empty)
   added: (holding b2) (clear b50)
   goals met: 4 of 9
6. (stack b2 b6)
   deleted: (clear b6) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b6)
   goals met: 6 of 9
7. (unstack b5 b47)
   deleted: (on b5 b47) (clear b5) (arm-empty)
   added: (holding b5) (clear b47)
   goals met: 5 of 9
8. (stack b5 b4)
   deleted: (clear b4) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b4)
   goals met: 7 of 9
9. (unstack b39 b1)
   deleted: (on b39 b1) (clear b39) (arm-empty)
   added: (holding b39) (clear b1)
   goals met: 7 of 9
10. (putdown b39)
   deleted: (holding b39)
   added: (clear b39) (arm-empty) (on-table b39)
   goals met: 7 of 9
11. (unstack b1 b43)
   deleted: (on b1 b43) (clear b1) (arm-empty)
   added: (holding b1) (clear b43)
   goals met: 7 of 9
12. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 8 of 9
13. (unstack b2 b6)
   deleted: (on b2 b6) (clear b2) (arm-empty)
   added: (holding b2) (clear b6)
   goals met: 6 of 9
14. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 7 of 9
15. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 7 of 9
16. (stack b6 b1)
   deleted: (clear b1) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b1)
   goals met: 8 of 9
17. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 7 of 9
18. (stack b2 b6)
   deleted: (clear b6) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b6)
   goals met: 9 of 9
